app/controllers/lists_controller.rb

  def show
    @list = List.find_by_slug(params[:id])
---
SELECT * FROM `lists` WHERE (`lists`.`slug` = 'common-adjectives') LIMIT 1

  def edit
    @list = List.find_by_slug(params[:id])
---
SELECT * FROM `lists` WHERE (`lists`.`slug` = 'common-adjectives') LIMIT 1

  def update
    @list = List.find_by_slug(params[:id])

    respond_to do |format|
      if @list.update_attributes(params[:list])
---
SELECT * FROM `lists` WHERE (`lists`.`slug` = 'common-adjectives') LIMIT 1
UPDATE `lists` SET `description` = 'Some fun words', `updated_at` = '2010-03-21 03:59:54' WHERE `id` = 83

  def destroy
    @list = List.find_by_slug(params[:id])
    @list.destroy
---
SELECT * FROM `lists` WHERE (`lists`.`slug` = 'common-verbs') LIMIT 1
DELETE FROM `lists` WHERE `id` = 84