app/controllers/lists_controller.rb

  def show
    @list = List.find(params[:id])
---
SELECT * FROM `lists` WHERE (`lists`.`id` = 0)

  def edit
    @list = List.find(params[:id])
---
SELECT * FROM `lists` WHERE (`lists`.`id` = 0)

  def update
    @list = List.find(params[:id])
---
SELECT * FROM `lists` WHERE (`lists`.`id` = 0)

  def destroy
    @list = List.find(params[:id])
---
SELECT * FROM `lists` WHERE (`lists`.`id` = 0)