app/controllers/test_controller.rb

SELECT * FROM `lists` WHERE (`lists`.`id` = 80)
SELECT `words`.* FROM `words` INNER JOIN `lists_words` ON `lists_words`.word_id = `words`.id INNER JOIN `lists` ON `lists`.id = `lists_words`.list_id WHERE (list_id = 80) ORDER BY RAND() LIMIT 1
---
  def list

    @lists = List.find(:all)

    @list = List.find(params[:id])

    @new_word = Word.find(
      :first,
      :joins => :lists,
      :conditions => ["list_id = ?", @list.id],
      :order => "RAND()"
    )